#### RevolvedSurface Members

---

|  |
| --- |
| RevolvedSurface Class   Methods   Properties   See Also |

The  RevolvedSurface  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Frame, Curve) | Creates a Surface object coincident with the surface of revolution defined by a coordinate frame and a profile curve. |
| Public method Static member | Create(XYZ, XYZ, Curve) | Creates a Surface object coincident with the surface of revolution defined by an axis and a profile curve. |
| Public method Static member | Create(Frame, Curve, Double, Double) | Creates a Surface object coincident with the surface of revolution defined by a coordinate frame, a profile curve, and start and end angles of revolution. |
| Public method Static member | Create(XYZ, XYZ, Curve, Double, Double) | Creates a Surface object coincident with the surface of revolution defined by an axis, a profile curve, and start and end angles of revolution. |
| Public method | Dispose | (Inherited from  Surface  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetBoundingBoxUV | Gets the UV bounding box of the surface. (Inherited from  Surface  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetProfileCurve | Returns a copy of the profile curve expressed in the surface's coordinate system. |
| Public method | GetProfileCurveInWorldCoordinates | Returns a copy of the profile curve expressed in the world coordinate system. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method Static member | IsValidProfileCurve(Frame, Curve) | Checks if the input profile curve is valid to create a surface of revolution in the given frame of reference. |
| Public method Static member | IsValidProfileCurve(XYZ, XYZ, Curve) | Checks if the input profile curve is valid to create a surface of revolution around the given axis. |
| Public method | Project | Project a 3D point orthogonally onto a surface (to find the nearest point). Throws InvalidOperationException if the projection fails. (Inherited from  Surface  .) |
| Public method | ProjectWithGuessPoint | Project a 3D point orthogonally onto a surface (to find the nearest point). This method is meant to be used when a good approximate solution for the projection is available. Throws InvalidOperationException if the projection fails. (Inherited from  Surface  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Axis | Axis of the revolved surface. This is the Z axis of the local coordinate system associated with this revolved surface. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  Surface  .) |
| Public property | OrientationMatchesParametricOrientation | Indicates whether this Surface's orientation is the same as or opposite to its parametric orientation. (Inherited from  Surface  .) |
| Public property | Origin | Center of the circle that defines the base of the revolved surface. This is the origin of the local coordinate system associated with this revolved surface. |
| Public property | XDir | X axis of the local coordinate system associated with this revolved surface. |
| Public property | YDir | X axis of the local coordinate system associated with this revolved surface. |

# See Also

RevolvedSurface Class

Autodesk.Revit.DB Namespace